bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
#include "bl702l_romdriver.h"


/**
 *  @brief Serail flash controller configuration structure type definition
 */
typedef struct
{
    BL_ENUM_Type owner;               /*!< Sflash interface bus owner */
    BL_ENUM_Type sahbClock;           /*!< Sflash clock sahb sram select */
    BL_ENUM_Type ahb2sifMode;         /*!< Sflash ahb2sif mode */
    uint8_t clkDelay;                 /*!< Clock count for read due to pad delay */
    uint8_t clkInvert;                /*!< Clock invert */
    uint8_t rxClkInvert;              /*!< RX clock invert */
    uint8_t doDelay;                  /*!< Data out delay */
    uint8_t diDelay;                  /*!< Data in delay */
    uint8_t oeDelay;                  /*!< Output enable delay */
} SF_Ctrl_Cfg_Type;

/**
 *  @brief SF Ctrl psram controller configuration structure type definition
 */
typedef struct
{
    BL_ENUM_Type owner;               /*!< Psram interface bus owner */
    BL_ENUM_Type padSel;              /*!< SF Ctrl pad select */
    BL_ENUM_Type bankSel;             /*!< SF Ctrl bank select */
    BL_ENUM_Type psramRxClkInvertSrc; /*!< Select psram rx clock invert source */
    BL_ENUM_Type psramRxClkInvertSel; /*!< Select inveted psram rx clock */
    BL_ENUM_Type psramDelaySrc;       /*!< Select psram read delay source */
    uint8_t psramClkDelay;            /*!< Psram read delay cycle = n + 1 */
} SF_Ctrl_Psram_Cfg;

/**
 *  @brief SF Ctrl cmds configuration structure type definition
 */
typedef struct
{
    BL_ENUM_Type cmdsEn;              /*!< SF Ctrl cmds enable */
    uint8_t wrapMode;                 /*!< SF Ctrl cmds wrap mode */
    BL_ENUM_Type wrapLen;             /*!< SF Ctrl cmds wrap length */
} SF_Ctrl_Cmds_Cfg;

/**
 *  @brief Serail flash command configuration structure type definition
 */
typedef struct
{
    uint8_t rwFlag;                   /*!< Read write flag */
    BL_ENUM_Type cmdMode;             /*!< Command mode */
    BL_ENUM_Type addrMode;            /*!< Address mode */
    uint8_t addrSize;                 /*!< Address size */
    uint8_t dummyClks;                /*!< Dummy clocks */
    BL_ENUM_Type dummyMode;           /*!< Dummy mode */
    BL_ENUM_Type dataMode;            /*!< Data mode */
    uint8_t rsv[1];                   /*!<  */
    uint32_t nbData;                  /*!< Transfer number of bytes */
    uint32_t cmdBuf[2];               /*!< Command buffer */
} SF_Ctrl_Cmd_Cfg_Type;


__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_On_MBG(void){
    return RomDriver_AON_Power_On_MBG();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_Off_MBG(void){
    return RomDriver_AON_Power_Off_MBG();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_On_XTAL(void){
    return RomDriver_AON_Power_On_XTAL();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Set_Xtal_CapCode(uint8_t capIn, uint8_t capOut){
    return RomDriver_AON_Set_Xtal_CapCode(capIn,capOut);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t AON_Get_Xtal_CapCode(void){
    return RomDriver_AON_Get_Xtal_CapCode();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Set_Xtal_CapCode_Extra(uint8_t extra){
    return RomDriver_AON_Set_Xtal_CapCode_Extra(extra);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_Off_XTAL(void){
    return RomDriver_AON_Power_Off_XTAL();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_On_BG(void){
    return RomDriver_AON_Power_On_BG();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_Off_BG(void){
    return RomDriver_AON_Power_Off_BG();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_On_LDO11_SOC(void){
    return RomDriver_AON_Power_On_LDO11_SOC();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_Off_LDO11_SOC(void){
    return RomDriver_AON_Power_Off_LDO11_SOC();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_On_SFReg(void){
    return RomDriver_AON_Power_On_SFReg();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Power_Off_SFReg(void){
    return RomDriver_AON_Power_Off_SFReg();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Set_LDO11_SOC_Sstart_Delay(uint8_t delay){
    return RomDriver_AON_Set_LDO11_SOC_Sstart_Delay(delay);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Set_DCDC14_Top_0(uint8_t voutSel, uint8_t vpfm){
    return RomDriver_AON_Set_DCDC14_Top_0(voutSel,vpfm);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Trim_Ldo11socVoutTrim(void){
    return RomDriver_AON_Trim_Ldo11socVoutTrim();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Trim_Ldo14VoutTrim(void){
    return RomDriver_AON_Trim_Ldo14VoutTrim();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type AON_Trim_Dcdc14VoutTrim(void){
    return RomDriver_AON_Trim_Dcdc14VoutTrim();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t Clock_System_Clock_Get(BL_System_Clock_Type type){
    return RomDriver_Clock_System_Clock_Get(type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t Clock_Peripheral_Clock_Get(BL_Peripheral_Type type){
    return RomDriver_Clock_Peripheral_Clock_Get(type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t SystemCoreClockGet(void){
    return RomDriver_SystemCoreClockGet();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t CPU_Get_MTimer_Clock(void){
    return RomDriver_CPU_Get_MTimer_Clock();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint64_t CPU_Get_MTimer_Counter(void){
    return RomDriver_CPU_Get_MTimer_Counter();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint64_t CPU_Get_CPU_Cycle(void){
    return RomDriver_CPU_Get_CPU_Cycle();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint64_t CPU_Get_MTimer_US(void){
    return RomDriver_CPU_Get_MTimer_US();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint64_t CPU_Get_MTimer_MS(void){
    return RomDriver_CPU_Get_MTimer_MS();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type CPU_MTimer_Delay_US(uint32_t cnt){
    return RomDriver_CPU_MTimer_Delay_US(cnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type CPU_MTimer_Delay_MS(uint32_t cnt){
    return RomDriver_CPU_MTimer_Delay_MS(cnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void BL702L_Delay_US(uint32_t cnt){
    return RomDriver_BL702L_Delay_US(cnt);
}

