bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_BMX_Init(BMX_Cfg_Type *BmxCfg){
    return RomDriver_GLB_BMX_Init(BmxCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_BMX_Addr_Monitor_Enable(void){
    return RomDriver_GLB_BMX_Addr_Monitor_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_BMX_Addr_Monitor_Disable(void){
    return RomDriver_GLB_BMX_Addr_Monitor_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_BMX_BusErrResponse_Enable(void){
    return RomDriver_GLB_BMX_BusErrResponse_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_BMX_BusErrResponse_Disable(void){
    return RomDriver_GLB_BMX_BusErrResponse_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type GLB_BMX_Get_Status(BMX_BUS_ERR_Type errType){
    return RomDriver_GLB_BMX_Get_Status(errType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t GLB_BMX_Get_Err_Addr(void){
    return RomDriver_GLB_BMX_Get_Err_Addr();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_BMX_BusErrClr_Set(uint8_t enable){
    return RomDriver_GLB_BMX_BusErrClr_Set(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_SRAM_PARM(uint32_t value){
    return RomDriver_GLB_Set_SRAM_PARM(value);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t GLB_Get_SRAM_PARM(void){
    return RomDriver_GLB_Get_SRAM_PARM();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_OCRAM_PARM(uint32_t value){
    return RomDriver_GLB_Set_OCRAM_PARM(value);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t GLB_Get_OCRAM_PARM(void){
    return RomDriver_GLB_Get_OCRAM_PARM();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_EM_Sel(GLB_EM_Type emType){
    return RomDriver_GLB_Set_EM_Sel(emType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_Kys_Drv_Col(uint8_t enable){
    return RomDriver_GLB_Set_Kys_Drv_Col(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_GPIO_O_Latch_Mode_Set(uint8_t enable){
    return RomDriver_GLB_GPIO_O_Latch_Mode_Set(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_JTAG_Sig_Swap_Set(uint8_t swapSel){
    return RomDriver_GLB_JTAG_Sig_Swap_Set(swapSel);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_CCI_Use_IO_0_1_2_7(uint8_t enable){
    return RomDriver_GLB_CCI_Use_IO_0_1_2_7(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_CCI_Use_Jtag_Pin(uint8_t enable){
    return RomDriver_GLB_CCI_Use_Jtag_Pin(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Swap_SPI_0_MOSI_With_MISO(BL_Fun_Type newState){
    return RomDriver_GLB_Swap_SPI_0_MOSI_With_MISO(newState);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_SPI_0_ACT_MOD_Sel(GLB_SPI_PAD_ACT_AS_Type mod){
    return RomDriver_GLB_Set_SPI_0_ACT_MOD_Sel(mod);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_Flash_Scenario(uint8_t enable){
    return RomDriver_GLB_Set_Flash_Scenario(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_Embedded_FLash_IO_PARM(uint8_t reverse, uint8_t swapIo3Io0, uint8_t swapIo2Cs){
    return RomDriver_GLB_Set_Embedded_FLash_IO_PARM(reverse,swapIo3Io0,swapIo2Cs);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_MTimer_CLK(uint8_t enable, GLB_MTIMER_CLK_Type clkSel, uint8_t div){
    return RomDriver_GLB_Set_MTimer_CLK(enable,clkSel,div);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_ADC_CLK(uint8_t enable, GLB_ADC_CLK_SRC_Type clkSel, uint8_t div){
    return RomDriver_GLB_Set_ADC_CLK(enable,clkSel,div);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_DIG_32K_CLK(uint8_t enable, uint8_t compensation, GLB_DIG_CLK_SRC_Type clkSel, uint16_t div){
    return RomDriver_GLB_Set_DIG_32K_CLK(enable,compensation,clkSel,div);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_SW_BLE_WAKEUP_REQ_Set(uint8_t enable){
    return RomDriver_GLB_SW_BLE_WAKEUP_REQ_Set(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_UART_Fun_Sel(GLB_UART_SIG_Type sig, GLB_UART_SIG_FUN_Type fun){
    return RomDriver_GLB_UART_Fun_Sel(sig,fun);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Power_Off_DLL(void){
    return RomDriver_GLB_Power_Off_DLL();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Power_On_DLL(GLB_DLL_XTAL_Type xtalType){
    return RomDriver_GLB_Power_On_DLL(xtalType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Enable_DLL_All_Clks(void){
    return RomDriver_GLB_Enable_DLL_All_Clks();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Enable_DLL_Clk(GLB_DLL_CLK_Type dllClk){
    return RomDriver_GLB_Enable_DLL_Clk(dllClk);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Disable_DLL_All_Clks(void){
    return RomDriver_GLB_Disable_DLL_All_Clks();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Disable_DLL_Clk(GLB_DLL_CLK_Type dllClk){
    return RomDriver_GLB_Disable_DLL_Clk(dllClk);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_Flash_Id_Value(uint32_t idValue){
    return RomDriver_GLB_Set_Flash_Id_Value(idValue);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t GLB_Get_Flash_Id_Value(void){
    return RomDriver_GLB_Get_Flash_Id_Value();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Trim_RC32M(void){
    return RomDriver_GLB_Trim_RC32M();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Set_Xtal_Cnt32k_Process(void){
    return RomDriver_GLB_Set_Xtal_Cnt32k_Process();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Clear_Xtal_Cnt32k_Done(void){
    return RomDriver_GLB_Clear_Xtal_Cnt32k_Done();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_RC32K_Deg_Start(void){
    return RomDriver_GLB_RC32K_Deg_Start();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_RC32K_Deg_End(void){
    return RomDriver_GLB_RC32K_Deg_End();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_RC32K_Deg_Enable(uint8_t enable){
    return RomDriver_GLB_RC32K_Deg_Enable(enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_Xtal_Deg_Cnt_Limit_Set(uint8_t cnt){
    return RomDriver_GLB_Xtal_Deg_Cnt_Limit_Set(cnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_IR_LED_Driver_Enable(void){
    return RomDriver_GLB_IR_LED_Driver_Enable();
}

