bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_BMX_Addr_Monitor_Enable(void){
    return RomDriver_L1C_BMX_Addr_Monitor_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_BMX_Addr_Monitor_Disable(void){
    return RomDriver_L1C_BMX_Addr_Monitor_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_BMX_BusErrResponse_Enable(void){
    return RomDriver_L1C_BMX_BusErrResponse_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_BMX_BusErrResponse_Disable(void){
    return RomDriver_L1C_BMX_BusErrResponse_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type L1C_BMX_Get_Status(L1C_BMX_BUS_ERR_Type errType){
    return RomDriver_L1C_BMX_Get_Status(errType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t L1C_BMX_Get_Err_Addr(void){
    return RomDriver_L1C_BMX_Get_Err_Addr();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_Type pin, PDS_GPIO_Cfg_Type *cfg){
    return RomDriver_PDS_Set_GPIO_Pad_Cfg(pin,cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_GPIO_Write(PDS_GPIO_GROUP_SET_Type grp, uint32_t val){
    return RomDriver_PDS_GPIO_Write(grp,val);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntMask(PDS_GPIO_GROUP_SET_Type grp, BL_Mask_Type intMask){
    return RomDriver_PDS_Set_GPIO_Pad_IntMask(grp,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntMode(PDS_GPIO_GROUP_SET_Type grp, PDS_GPIO_INT_TRIG_Type trig){
    return RomDriver_PDS_Set_GPIO_Pad_IntMode(grp,trig);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntClr(PDS_GPIO_GROUP_SET_Type grp){
    return RomDriver_PDS_Set_GPIO_Pad_IntClr(grp);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_All_GPIO_IntClear(void){
    return RomDriver_PDS_Set_All_GPIO_IntClear();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type PDS_Get_GPIO_Pad_IntStatus(PDS_GPIO_Type pin){
    return RomDriver_PDS_Get_GPIO_Pad_IntStatus(pin);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Disable_GPIO_Keep(void){
    return RomDriver_PDS_Disable_GPIO_Keep();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt){
    return RomDriver_PDS_Enable(cfg,cfg4,pdsSleepCnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3){
    return RomDriver_PDS_Force_Config(cfg2,cfg3);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_RAM_Config(PDS_RAM_CFG_Type *ramCfg){
    return RomDriver_PDS_RAM_Config(ramCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Default_Level_Config(PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, uint32_t pdsSleepCnt){
    return RomDriver_PDS_Default_Level_Config(defaultLvCfg,pdsSleepCnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Wakeup_Src_En(PDS_WAKEUP_SRC_Type intType, BL_Fun_Type enable){
    return RomDriver_PDS_Wakeup_Src_En(intType,enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type PDS_Get_Wakeup_Src(PDS_WAKEUP_SRC_Type intType){
    return RomDriver_PDS_Get_Wakeup_Src(intType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_IntMask(PDS_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_PDS_IntMask(intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type PDS_Get_IntStatus(PDS_INT_Type intType){
    return RomDriver_PDS_Get_IntStatus(intType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_IntClear(void){
    return RomDriver_PDS_IntClear();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
PDS_RF_STS_Type PDS_Get_PdsRfStstus(void){
    return RomDriver_PDS_Get_PdsRfStstus();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
PDS_STS_Type PDS_Get_PdsStstus(void){
    return RomDriver_PDS_Get_PdsStstus();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Clear_Reset_Event(void){
    return RomDriver_PDS_Clear_Reset_Event();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type PDS_Get_Reset_Event(PDS_RST_EVENT_Type event){
    return RomDriver_PDS_Get_Reset_Event(event);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void PDS_Auto_Enable(PDS_AUTO_POWER_DOWN_CFG_Type *powerCfg, PDS_AUTO_NORMAL_CFG_Type *normalCfg, BL_Fun_Type enable){
    return RomDriver_PDS_Auto_Enable(powerCfg,normalCfg,enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void PDS_Manual_Force_Turn_Off(PDS_FORCE_Type domain){
    return RomDriver_PDS_Manual_Force_Turn_Off(domain);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void PDS_Manual_Force_Turn_On(PDS_FORCE_Type domain){
    return RomDriver_PDS_Manual_Force_Turn_On(domain);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_KYD_Matrix_Size(uint8_t col_size, uint8_t row_size){
    return RomDriver_PDS_Set_KYD_Matrix_Size(col_size,row_size);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_KYD_Col_Value(uint8_t val){
    return RomDriver_PDS_Set_KYD_Col_Value(val);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_KYD_Row_Pull(uint8_t en){
    return RomDriver_PDS_Set_KYD_Row_Pull(en);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_KYD_Wakeup_En(uint8_t en){
    return RomDriver_PDS_Set_KYD_Wakeup_En(en);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_cfg_init_internal_flash_gpio(void){
    return RomDriver_SF_Cfg_Init_Internal_Flash_Gpio();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sf_cfg_init_ext_flash_gpio(uint8_t ext_flash_pin){
    return RomDriver_SF_Cfg_Init_Ext_Flash_Gpio(ext_flash_pin);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sf_cfg_deinit_ext_flash_gpio(uint8_t ext_flash_pin){
    return RomDriver_SF_Cfg_Deinit_Ext_Flash_Gpio(ext_flash_pin);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sf_cfg_get_flash_cfg_need_lock(uint32_t flash_id, spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank){
    return RomDriver_SF_Cfg_Get_Flash_Cfg_Need_Lock(flash_id,p_flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sf_cfg_init_flash_gpio(uint8_t flash_pin_cfg, uint8_t restore_default){
    return RomDriver_SF_Cfg_Init_Flash_Gpio(flash_pin_cfg,restore_default);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t bflb_sf_cfg_flash_identify(uint8_t call_from_flash, uint8_t flash_pin_cfg, uint8_t restore_default, spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank){
    uint8_t auto_scan = 0;
    uint8_t flash_pin = 0;
    auto_scan = ((flash_pin_cfg >> 7) & 1);
    flash_pin = (flash_pin_cfg & 0x7F);
    return RomDriver_SF_Cfg_Flash_Identify(call_from_flash,auto_scan,flash_pin,restore_default,p_flash_cfg);
}

