bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_enable(const struct sf_ctrl_cfg_type *cfg){
    SF_Ctrl_Cfg_Type sf_ctrl_cfg = {
        .owner = cfg->owner,
        .sahbClock = cfg->sahb_clock,
        .ahb2sifMode = cfg->ahb2sif_mode,
        .clkDelay = cfg->clk_delay,
        .clkInvert = cfg->clk_invert,
        .rxClkInvert = cfg->rx_clk_invert,
        .doDelay = cfg->do_delay,
        .diDelay = cfg->di_delay,
        .oeDelay = cfg->oe_delay,
    };
    return RomDriver_SF_Ctrl_Enable((const struct sf_ctrl_cfg_type *)&sf_ctrl_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_psram_init(struct sf_ctrl_psram_cfg *sf_ctrl_psram_cfg){
    SF_Ctrl_Psram_Cfg cfg = {
        .owner = sf_ctrl_psram_cfg->owner,
        .padSel = sf_ctrl_psram_cfg->pad_sel,
        .bankSel = sf_ctrl_psram_cfg->bank_sel,
        .psramRxClkInvertSrc = sf_ctrl_psram_cfg->psram_rx_clk_invert_src,
        .psramRxClkInvertSel = sf_ctrl_psram_cfg->psram_rx_clk_invert_sel,
        .psramDelaySrc = sf_ctrl_psram_cfg->psram_delay_src,
        .psramClkDelay = sf_ctrl_psram_cfg->psram_clk_delay,
    };
    return RomDriver_SF_Ctrl_Psram_Init((struct sf_ctrl_psram_cfg *)&cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t bflb_sf_ctrl_get_clock_delay(void){
    return RomDriver_SF_Ctrl_Get_Clock_Delay();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_set_clock_delay(uint8_t delay){
    return RomDriver_SF_Ctrl_Set_Clock_Delay(delay);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_cmds_set(struct sf_ctrl_cmds_cfg *cmds_cfg, uint8_t sel){
    SF_Ctrl_Cmds_Cfg cfg = {
        .cmdsEn = cmds_cfg->cmds_en,
        .wrapMode = cmds_cfg->cmds_wrap_mode,
        .wrapLen = cmds_cfg->cmds_wrap_len,
    };
    return RomDriver_SF_Ctrl_Cmds_Set((struct sf_ctrl_cmds_cfg *)&cfg,sel);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_burst_toggle_set(uint8_t burst_toggle_en, uint8_t mode){
    return RomDriver_SF_Ctrl_Burst_Toggle_Set(burst_toggle_en,mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_select_pad(uint8_t sel){
    return RomDriver_SF_Ctrl_Select_Pad(sel);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_select_bank(uint8_t sel){
    return RomDriver_SF_Ctrl_Select_Bank(sel);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_set_owner(uint8_t owner){
    return RomDriver_SF_Ctrl_Set_Owner(owner);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_disable(void){
    return RomDriver_SF_Ctrl_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_enable_be(void){
    return RomDriver_SF_Ctrl_AES_Enable_BE();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_enable_le(void){
    return RomDriver_SF_Ctrl_AES_Enable_LE();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_set_region(uint8_t region, uint8_t enable, uint8_t hwKey, uint32_t start_addr, uint32_t end_addr, uint8_t locked){
    return RomDriver_SF_Ctrl_AES_Set_Region(region,enable,hwKey,start_addr,end_addr,locked);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_set_key(uint8_t region, uint8_t *key, uint8_t key_type){
    return RomDriver_SF_Ctrl_AES_Set_Key(region,key,key_type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_set_key_be(uint8_t region, uint8_t *key, uint8_t key_type){
    return RomDriver_SF_Ctrl_AES_Set_Key_BE(region,key,key_type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_set_iv(uint8_t region, uint8_t *iv, uint32_t addr_offset){
    return RomDriver_SF_Ctrl_AES_Set_IV(region,iv,addr_offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_set_iv_be(uint8_t region, uint8_t *iv, uint32_t addr_offset){
    return RomDriver_SF_Ctrl_AES_Set_IV_BE(region,iv,addr_offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_enable(void){
    return RomDriver_SF_Ctrl_AES_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_aes_disable(void){
    return RomDriver_SF_Ctrl_AES_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t bflb_sf_ctrl_is_aes_enable(void){
    return RomDriver_SF_Ctrl_Is_AES_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_set_flash_image_offset(uint32_t addr_offset, uint8_t group, uint8_t bank){
    return RomDriver_SF_Ctrl_Set_Flash_Image_Offset(addr_offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t bflb_sf_ctrl_get_flash_image_offset(uint8_t group, uint8_t bank){
    return RomDriver_SF_Ctrl_Get_Flash_Image_Offset();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_sendcmd(struct sf_ctrl_cmd_cfg_type *cfg){
    SF_Ctrl_Cmd_Cfg_Type cmd_cfg = {
        .rwFlag = cfg->rw_flag,
        .cmdMode = cfg->cmd_mode,
        .addrMode = cfg->addr_mode,
        .addrSize = cfg->addr_size,
        .dummyClks = cfg->dummy_clks,
        .dummyMode = cfg->dummy_mode,
        .dataMode = cfg->data_mode,
        .nbData = cfg->nb_data,
        .cmdBuf = {cfg->cmd_buf[0], cfg->cmd_buf[1]},
    };
    return RomDriver_SF_Ctrl_SendCmd((struct sf_ctrl_cmd_cfg_type *)&cmd_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_flash_read_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid){
    SF_Ctrl_Cmd_Cfg_Type cmd_cfg = {
        .rwFlag = cfg->rw_flag,
        .cmdMode = cfg->cmd_mode,
        .addrMode = cfg->addr_mode,
        .addrSize = cfg->addr_size,
        .dummyClks = cfg->dummy_clks,
        .dummyMode = cfg->dummy_mode,
        .dataMode = cfg->data_mode,
        .nbData = cfg->nb_data,
        .cmdBuf = {cfg->cmd_buf[0], cfg->cmd_buf[1]},
    };
    return RomDriver_SF_Ctrl_Flash_Read_Icache_Set((struct sf_ctrl_cmd_cfg_type *)&cmd_cfg,cmd_valid);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_psram_write_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid){
    SF_Ctrl_Cmd_Cfg_Type cmd_cfg = {
        .rwFlag = cfg->rw_flag,
        .cmdMode = cfg->cmd_mode,
        .addrMode = cfg->addr_mode,
        .addrSize = cfg->addr_size,
        .dummyClks = cfg->dummy_clks,
        .dummyMode = cfg->dummy_mode,
        .dataMode = cfg->data_mode,
        .nbData = cfg->nb_data,
        .cmdBuf = {cfg->cmd_buf[0], cfg->cmd_buf[1]},
    };
    return RomDriver_SF_Ctrl_Psram_Write_Icache_Set((struct sf_ctrl_cmd_cfg_type *)&cmd_cfg,cmd_valid);
}

