bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_psram_read_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid){
    SF_Ctrl_Cmd_Cfg_Type cmd_cfg = {
        .rwFlag = cfg->rw_flag,
        .cmdMode = cfg->cmd_mode,
        .addrMode = cfg->addr_mode,
        .addrSize = cfg->addr_size,
        .dummyClks = cfg->dummy_clks,
        .dummyMode = cfg->dummy_mode,
        .dataMode = cfg->data_mode,
        .nbData = cfg->nb_data,
        .cmdBuf = {cfg->cmd_buf[0], cfg->cmd_buf[1]},
    };
    return RomDriver_SF_Ctrl_Psram_Read_Icache_Set((struct sf_ctrl_cmd_cfg_type *)&cmd_cfg,cmd_valid);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t bflb_sf_ctrl_get_busy_state(void){
    return RomDriver_SF_Ctrl_GetBusyState();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_init(const struct sf_ctrl_cfg_type *p_sf_ctrl_cfg){
    SF_Ctrl_Cfg_Type sf_ctrl_cfg = {
        .owner = p_sf_ctrl_cfg->owner,
        .sahbClock = p_sf_ctrl_cfg->sahb_clock,
        .ahb2sifMode = p_sf_ctrl_cfg->ahb2sif_mode,
        .clkDelay = p_sf_ctrl_cfg->clk_delay,
        .clkInvert = p_sf_ctrl_cfg->clk_invert,
        .rxClkInvert = p_sf_ctrl_cfg->rx_clk_invert,
        .doDelay = p_sf_ctrl_cfg->do_delay,
        .diDelay = p_sf_ctrl_cfg->di_delay,
        .oeDelay = p_sf_ctrl_cfg->oe_delay,
    };
    return RomDriver_SFlash_Init((const struct sf_ctrl_cfg_type *)&sf_ctrl_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_set_spi_mode(uint8_t mode){
    return RomDriver_SFlash_SetSPIMode(mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_read_reg(spi_flash_cfg_type *flash_cfg, uint8_t reg_index, uint8_t *reg_value, uint8_t reg_len){
    return RomDriver_SFlash_Read_Reg(flash_cfg,reg_index,reg_value,reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_write_reg(spi_flash_cfg_type *flash_cfg, uint8_t reg_index, uint8_t *reg_value, uint8_t reg_len){
    return RomDriver_SFlash_Write_Reg(flash_cfg,reg_index,reg_value,reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_read_reg_with_cmd(spi_flash_cfg_type *flash_cfg, uint8_t read_reg_cmd, uint8_t *reg_value, uint8_t reg_len){
    return RomDriver_SFlash_Read_Reg_With_Cmd(flash_cfg,read_reg_cmd,reg_value,reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_write_reg_with_cmd(spi_flash_cfg_type *flash_cfg, uint8_t write_reg_cmd, uint8_t *reg_value, uint8_t reg_len){
    return RomDriver_SFlash_Write_Reg_With_Cmd(flash_cfg,write_reg_cmd,reg_value,reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_clear_status_register(spi_flash_cfg_type *p_flash_cfg){
    return RomDriver_SFlash_Clear_Status_Register(p_flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_busy(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Busy(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_write_enable(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Write_Enable(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_qspi_enable(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Qspi_Enable(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_volatile_reg_write_enable(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Volatile_Reg_Write_Enable(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_chip_erase(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Chip_Erase(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_sector_erase(spi_flash_cfg_type *flash_cfg, uint32_t sec_num){
    return RomDriver_SFlash_Sector_Erase(flash_cfg,sec_num);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_blk32_erase(spi_flash_cfg_type *flash_cfg, uint32_t blk_num){
    return RomDriver_SFlash_Blk32_Erase(flash_cfg,blk_num);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_blk64_erase(spi_flash_cfg_type *flash_cfg, uint32_t blk_num){
    return RomDriver_SFlash_Blk64_Erase(flash_cfg,blk_num);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_erase(spi_flash_cfg_type *flash_cfg, uint32_t startaddr, uint32_t endaddr){
    return RomDriver_SFlash_Erase(flash_cfg,startaddr,endaddr);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_program(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len){
    return RomDriver_SFlash_Program(flash_cfg,io_mode,addr,data,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_get_uniqueid(uint8_t *data, uint8_t id_len){
    return RomDriver_SFlash_GetUniqueId(data,id_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_get_jedecid(spi_flash_cfg_type *flash_cfg, uint8_t *data){
    return RomDriver_SFlash_GetJedecId(flash_cfg,data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_get_deviceid(uint8_t *data, uint8_t is_32bits_addr){
    return RomDriver_SFlash_GetDeviceId(data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_powerdown(void){
    return RomDriver_SFlash_Powerdown();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_releae_powerdown(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Releae_Powerdown(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_restore_from_powerdown(spi_flash_cfg_type *p_flash_cfg, uint8_t flash_cont_read, uint8_t bank){
    return RomDriver_SFlash_Restore_From_Powerdown(p_flash_cfg,flash_cont_read);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_set_burst_wrap(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_SetBurstWrap(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_disable_burst_wrap(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_DisableBurstWrap(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_software_reset(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Software_Reset(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sflash_reset_continue_read(spi_flash_cfg_type *flash_cfg){
    return RomDriver_SFlash_Reset_Continue_Read(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_sflash_set_idbus_cfg(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint8_t cont_read, uint32_t addr, uint32_t len, uint8_t bank){
    return RomDriver_SFlash_Set_IDbus_Cfg(flash_cfg,io_mode,cont_read,addr,len);
}

