bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type UART_GetTxBusBusyStatus(UART_ID_Type uartId){
    return RomDriver_UART_GetTxBusBusyStatus(uartId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type UART_GetRxBusBusyStatus(UART_ID_Type uartId){
    return RomDriver_UART_GetRxBusBusyStatus(uartId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type UART_GetOverflowStatus(UART_ID_Type uartId, UART_Overflow_Type overflow){
    return RomDriver_UART_GetOverflowStatus(uartId,overflow);
}
#endif
__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_xip_sflash_opt_enter(uint8_t *aes_enable){
    return RomDriver_XIP_SFlash_Opt_Enter(aes_enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_xip_sflash_opt_exit(uint8_t aes_enable){
    return RomDriver_XIP_SFlash_Opt_Exit(aes_enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_state_save(spi_flash_cfg_type *p_flash_cfg, uint32_t *offset, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_State_Save(p_flash_cfg,offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_state_restore(spi_flash_cfg_type *p_flash_cfg, uint32_t offset, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_State_Restore(p_flash_cfg,offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_erase_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t startaddr, int len, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_Erase_Need_Lock(p_flash_cfg,startaddr,startaddr+len-1);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_write_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_Write_Need_Lock(p_flash_cfg,addr,data,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_read_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_Read_Need_Lock(p_flash_cfg,addr,data,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_get_jedecid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t *data, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_GetJedecId_Need_Lock(p_flash_cfg,data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_get_deviceid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t is_32bits_addr, uint8_t *data, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_GetDeviceId_Need_Lock(p_flash_cfg,data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_get_uniqueid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t *data, uint8_t id_len, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_GetUniqueId_Need_Lock(p_flash_cfg,data,id_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_read_via_cache_need_lock(uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_Read_Via_Cache_Need_Lock(addr,data,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int bflb_xip_sflash_clear_status_register_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank){
    return RomDriver_XIP_SFlash_Clear_Status_Register_Need_Lock(p_flash_cfg);
}
#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_TxInit(IR_TxCfg_Type *irTxCfg){
    return RomDriver_IR_TxInit(irTxCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_TxPulseWidthConfig(IR_TxPulseWidthCfg_Type *irTxPulseWidthCfg){
    return RomDriver_IR_TxPulseWidthConfig(irTxPulseWidthCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_FifoConfig(IR_FifoCfg_Type *fifoCfg){
    return RomDriver_IR_FifoConfig(fifoCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_DeInit(void){
    return RomDriver_IR_DeInit();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_Enable(IR_Direction_Type direct){
    return RomDriver_IR_Enable(direct);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_Disable(IR_Direction_Type direct){
    return RomDriver_IR_Disable(direct);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_TxSWM(BL_Fun_Type txSWM){
    return RomDriver_IR_TxSWM(txSWM);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_TxFifoClear(void){
    return RomDriver_IR_TxFifoClear();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_SendData(uint32_t *data, uint8_t length){
    return RomDriver_IR_SendData(data,length);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_SWMSendData(uint16_t *data, uint8_t length){
    return RomDriver_IR_SWMSendData(data,length);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_SendCommand(uint32_t *data, uint8_t length){
    return RomDriver_IR_SendCommand(data,length);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_SWMSendCommand(uint16_t *data, uint8_t length){
    return RomDriver_IR_SWMSendCommand(data,length);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_SendNEC(uint8_t address, uint8_t command){
    return RomDriver_IR_SendNEC(address,command);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_IntMask(IR_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_IR_IntMask(intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_ClrIntStatus(IR_INT_Type intType){
    return RomDriver_IR_ClrIntStatus(intType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type IR_GetIntStatus(IR_INT_Type intType){
    return RomDriver_IR_GetIntStatus(intType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type IR_GetFifoStatus(IR_FifoStatus_Type fifoSts){
    return RomDriver_IR_GetFifoStatus(fifoSts);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t IR_GetTxFifoCount(void){
    return RomDriver_IR_GetTxFifoCount();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_LEDInit(uint8_t clk, uint8_t div, uint8_t unit, uint8_t code0H, uint8_t code0L, uint8_t code1H, uint8_t code1L){
    return RomDriver_IR_LEDInit(clk,div,unit,code0H,code0L,code1H,code1L);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type IR_LEDSend(uint32_t data){
    return RomDriver_IR_LEDSend(data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type KYS_Init(KYS_CFG_Type *kysCfg){
    return RomDriver_KYS_Init(kysCfg);
}

