bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type KYS_Enable(void){
    return RomDriver_KYS_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type KYS_Disable(void){
    return RomDriver_KYS_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type KYS_IntMask(KYS_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_KYS_IntMask(intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type KYS_IntClear(KYS_INT_CLR_Type intType){
    return RomDriver_KYS_IntClear(intType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type KYS_GetIntStatus(KYS_INT_Type intType){
    return RomDriver_KYS_GetIntStatus(intType);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void KYS_Get_FIFO_Idx(uint8_t *fifo_head, uint8_t *fifo_tail){
    return RomDriver_KYS_Get_FIFO_Idx(fifo_head,fifo_tail);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t KYS_ReadKeyfifo(void){
    return RomDriver_KYS_ReadKeyfifo();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_psram_init(struct spi_psram_cfg_type *psram_cfg, struct sf_ctrl_cmds_cfg *cmds_cfg, struct sf_ctrl_psram_cfg *sf_ctrl_psram_cfg){
    return RomDriver_Psram_Init(psram_cfg,cmds_cfg,sf_ctrl_psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_psram_readreg(struct spi_psram_cfg_type *psram_cfg, uint8_t *reg_value){
    return RomDriver_Psram_ReadReg(psram_cfg,reg_value);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_psram_writereg(struct spi_psram_cfg_type *psram_cfg, uint8_t *reg_value){
    return RomDriver_Psram_WriteReg(psram_cfg,reg_value);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_setdrivestrength(struct spi_psram_cfg_type *psram_cfg){
    return RomDriver_Psram_SetDriveStrength(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_setburstwrap(struct spi_psram_cfg_type *psram_cfg){
    return RomDriver_Psram_SetBurstWrap(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_psram_readid(struct spi_psram_cfg_type *psram_cfg, uint8_t *data){
    return RomDriver_Psram_ReadId(psram_cfg,data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_enterquadmode(struct spi_psram_cfg_type *psram_cfg){
    return RomDriver_Psram_EnterQuadMode(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_exitquadmode(struct spi_psram_cfg_type *psram_cfg){
    return RomDriver_Psram_ExitQuadMode(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_toggleburstlength(struct spi_psram_cfg_type *psram_cfg, uint8_t ctrl_mode){
    return RomDriver_Psram_ToggleBurstLength(psram_cfg,ctrl_mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_softwarereset(struct spi_psram_cfg_type *psram_cfg, uint8_t ctrl_mode){
    return RomDriver_Psram_SoftwareReset(psram_cfg,ctrl_mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_set_idbus_cfg(struct spi_psram_cfg_type *psram_cfg, uint8_t io_mode, uint32_t addr, uint32_t len){
    return RomDriver_Psram_Set_IDbus_Cfg(psram_cfg,io_mode,addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_cache_write_set(struct spi_psram_cfg_type *psram_cfg, uint8_t io_mode, BL_Fun_Type wt_en, BL_Fun_Type wb_en, BL_Fun_Type wa_en){
    return RomDriver_Psram_Cache_Write_Set(psram_cfg,io_mode,wt_en,wb_en,wa_en);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_write(struct spi_psram_cfg_type *psram_cfg, uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len){
    return RomDriver_Psram_Write(psram_cfg,io_mode,addr,data,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type bflb_psram_read(struct spi_psram_cfg_type *psram_cfg, uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len){
    return RomDriver_Psram_Read(psram_cfg,io_mode,addr,data,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t TIMER_GetCompValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo){
    return RomDriver_TIMER_GetCompValue(timerId,timerCh,cmpNo);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_SetCompValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo, uint32_t val){
    return RomDriver_TIMER_SetCompValue(timerId,timerCh,cmpNo,val);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_CompValueEffectImmediately(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, BL_Fun_Type enable){
    return RomDriver_TIMER_CompValueEffectImmediately(timerId,timerCh,enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t TIMER_GetCounterValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh){
    return RomDriver_TIMER_GetCounterValue(timerId,timerCh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_ResetCounterValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh){
    return RomDriver_TIMER_ResetCounterValue(timerId,timerCh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type TIMER_GetMatchStatus(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo){
    return RomDriver_TIMER_GetMatchStatus(timerId,timerCh,cmpNo);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t TIMER_GetPreloadValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh){
    return RomDriver_TIMER_GetPreloadValue(timerId,timerCh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_SetPreloadValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, uint32_t val){
    return RomDriver_TIMER_SetPreloadValue(timerId,timerCh,val);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_SetPreloadTrigSrc(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_PreLoad_Trig_Type plSrc){
    return RomDriver_TIMER_SetPreloadTrigSrc(timerId,timerCh,plSrc);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_SetCountMode(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_CountMode_Type countMode){
    return RomDriver_TIMER_SetCountMode(timerId,timerCh,countMode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_ClearIntStatus(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo){
    return RomDriver_TIMER_ClearIntStatus(timerId,timerCh,cmpNo);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type TIMER_Init(TIMER_ID_Type timerId, TIMER_CFG_Type *timerCfg){
    return RomDriver_TIMER_Init(timerId,timerCfg);
}

