bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type TIMER_DeInit(TIMER_ID_Type timerId){
    return RomDriver_TIMER_DeInit(timerId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_Enable(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh){
    return RomDriver_TIMER_Enable(timerId,timerCh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_Disable(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh){
    return RomDriver_TIMER_Disable(timerId,timerCh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_IntMask(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_TIMER_IntMask(timerId,timerCh,intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_GPIOSetPolarity(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_GPIO_Polarity_Type polarity){
    return RomDriver_TIMER_GPIOSetPolarity(timerId,timerCh,polarity);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_CH0_SetMeasurePulseWidth(TIMER_ID_Type timerId, BL_Fun_Type enable){
    return RomDriver_TIMER_CH0_SetMeasurePulseWidth(timerId,enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t TIMER_CH0_GetMeasurePulseWidth(TIMER_ID_Type timerId){
    return RomDriver_TIMER_CH0_GetMeasurePulseWidth(timerId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void TIMER_ForceClockDivision(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh){
    return RomDriver_TIMER_ForceClockDivision(timerId,timerCh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_Set_Clock(WDT_ID_Type wdtId, TIMER_ClkSrc_Type clkSrc, uint8_t div){
    return RomDriver_WDT_Set_Clock(wdtId,clkSrc,div);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint16_t WDT_GetMatchValue(WDT_ID_Type wdtId){
    return RomDriver_WDT_GetMatchValue(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_SetCompValue(WDT_ID_Type wdtId, uint16_t val){
    return RomDriver_WDT_SetCompValue(wdtId,val);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_CompValueEffectImmediately(WDT_ID_Type wdtId, BL_Fun_Type enable){
    return RomDriver_WDT_CompValueEffectImmediately(wdtId,enable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint16_t WDT_GetCounterValue(WDT_ID_Type wdtId){
    return RomDriver_WDT_GetCounterValue(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_ResetCounterValue(WDT_ID_Type wdtId){
    return RomDriver_WDT_ResetCounterValue(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Sts_Type WDT_GetResetStatus(WDT_ID_Type wdtId){
    return RomDriver_WDT_GetResetStatus(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_ClearResetStatus(WDT_ID_Type wdtId){
    return RomDriver_WDT_ClearResetStatus(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_Enable(WDT_ID_Type wdtId){
    return RomDriver_WDT_Enable(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_Disable(WDT_ID_Type wdtId){
    return RomDriver_WDT_Disable(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_ForceClockDivision(WDT_ID_Type wdtId){
    return RomDriver_WDT_ForceClockDivision(wdtId);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_IntMask(WDT_ID_Type wdtId, WDT_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_WDT_IntMask(wdtId,intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void WDT_GPIOSetPolarity(WDT_ID_Type wdtId, TIMER_GPIO_Polarity_Type polarity){
    return RomDriver_WDT_GPIOSetPolarity(wdtId,polarity);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void * arch_memcpy(void *dst, const void *src, uint32_t n){
    return RomDriver_arch_memcpy(dst,src,n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t * arch_memcpy4(uint32_t *dst, const uint32_t *src, uint32_t n){
    return RomDriver_arch_memcpy4(dst,src,n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void * arch_memcpy_fast(void *pdst, const void *psrc, uint32_t n){
    return RomDriver_arch_memcpy_fast(pdst,psrc,n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void * arch_memset(void *s, uint8_t c, uint32_t n){
    return RomDriver_arch_memset(s,c,n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t * arch_memset4(uint32_t *dst, const uint32_t val, uint32_t n){
    return RomDriver_arch_memset4(dst,val,n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int arch_memcmp(const void *s1, const void *s2, uint32_t n){
    return RomDriver_arch_memcmp(s1,s2,n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void memcopy_to_fifo(void *fifo_addr, uint8_t *data, uint32_t length){
    return RomDriver_memcopy_to_fifo(fifo_addr,data,length);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void fifocopy_to_mem(void *fifo_addr, uint8_t *data, uint32_t length){
    return RomDriver_fifocopy_to_mem(fifo_addr,data,length);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t BFLB_Soft_CRC32_Ex(uint32_t initial, void *dataIn, uint32_t len){
    return RomDriver_BFLB_Soft_CRC32_Ex(initial,dataIn,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t BFLB_Soft_CRC32(void *dataIn, uint32_t len){
    return RomDriver_BFLB_Soft_CRC32(dataIn,len);
}
#endif